tensorflow/tf2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-06-29 Mo 22:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>tf2</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="sx" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">tf2</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6d37b5c">Check GPU</a></li>
<li><a href="#orgb4cd477">Tensorflow foundation</a>
<ul>
<li><a href="#orgcc04d4b">数值类型</a></li>
<li><a href="#org94b026c">Reference(,) and Segment(:)</a></li>
<li><a href="#org6b744f4">改变视图</a>
<ul>
<li><a href="#org5e5eb69">增加维度</a></li>
<li><a href="#orgfdde96c">删除维度</a></li>
</ul>
</li>
<li><a href="#org474747b">交换维度</a></li>
<li><a href="#orgdb7cdae">Broadcasting</a></li>
<li><a href="#org58d2f9d">tile</a></li>
<li><a href="#orgceea294">Concatenate &amp; Stack &amp; Split &amp; unstack</a></li>
<li><a href="#orgb57af20">Statistik</a></li>
<li><a href="#org67784d8">Padding</a></li>
<li><a href="#org8ed14de">advance manipulation</a>
<ul>
<li><a href="#org04e04d4">tf.minimum</a></li>
<li><a href="#org61dd24a">tf.gather</a></li>
<li><a href="#org15b5d72">tf.gather<sub>nd</sub></a></li>
<li><a href="#org86214c5">tf.boolean<sub>mask</sub></a></li>
<li><a href="#orgd83a9d4">tf.where</a></li>
<li><a href="#orgd139fc8">tf.scatter<sub>nd</sub></a></li>
<li><a href="#org94aece7">tf.meshgrid</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf39c541">activation function</a>
<ul>
<li><a href="#org76d1e1c">no activation</a></li>
<li><a href="#org52e7357">Sigmoid</a></li>
<li><a href="#org913dddc">ReLU</a></li>
<li><a href="#orgc0560b9">LeakyReLU</a></li>
<li><a href="#orgd2ecd24">Tanh</a></li>
<li><a href="#org109efa9">MSE</a></li>
<li><a href="#orga9f2ba1">inf entropy</a></li>
<li><a href="#org4176fba">softmax</a></li>
<li><a href="#org56c7e7f">cross entropy</a></li>
</ul>
</li>
<li><a href="#org3c874aa">Backpropagation</a>
<ul>
<li><a href="#org4cdb1fd">感知机</a></li>
<li><a href="#orgc1a2280">多层神经网络</a></li>
</ul>
</li>
<li><a href="#org1aade61">chapter 01</a></li>
<li><a href="#org4a22609">MNIST dataset</a></li>
<li><a href="#org2b617fd">Make<sub>moons</sub></a></li>
<li><a href="#org15d002d">Keras</a>
<ul>
<li><a href="#org85c17fb">tf.keras</a></li>
<li><a href="#org106b974">模型的保存和加载</a>
<ul>
<li><a href="#org26195f7">保存数值</a></li>
<li><a href="#org6732694">保存框架</a></li>
<li><a href="#orgb18a191">跨系统平台保存恢复</a></li>
</ul>
</li>
<li><a href="#org3128177">self-def</a></li>
</ul>
</li>
<li><a href="#org1dec6c9">regularation</a>
<ul>
<li><a href="#org8c17045">L0</a></li>
<li><a href="#org7770020">L1</a></li>
<li><a href="#org0f6a4bf">L2</a></li>
</ul>
</li>
<li><a href="#org4555ebc">Dropout</a></li>
<li><a href="#org542d182">Data Augmentation</a>
<ul>
<li><a href="#orga1bb446">resize</a></li>
<li><a href="#org035c0c7">rote</a></li>
<li><a href="#orgc854041">flip</a></li>
<li><a href="#org92f9bb2">crop</a></li>
</ul>
</li>
<li><a href="#org94b0034">convolution neural network</a></li>
<li><a href="#org0db8c95">Backlinks</a></li>
<li><a href="#orga429ff7">1 Backlinks</a>
<ul>
<li><a href="#org3698520">AI</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
tensorflow2手册的相关代码
</p>
<div id="outline-container-org6d37b5c" class="outline-2">
<h2 id="org6d37b5c">Check GPU</h2>
<div class="outline-text-2" id="text-org6d37b5c">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> tensorflow <span style="color: #4f97d7; font-weight: bold;">as</span> tf
<span style="color: #4f97d7; font-weight: bold;">if</span> (tf.test.is_gpu_available(cuda_only=<span style="color: #a45bad;">False</span>, min_cuda_compute_capability=<span style="color: #a45bad;">None</span>)==<span style="color: #a45bad;">True</span>):
    <span style="color: #4f97d7; font-weight: bold;">print</span>(<span style="color: #2d9574;">"using gpu"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb4cd477" class="outline-2">
<h2 id="orgb4cd477">Tensorflow foundation</h2>
<div class="outline-text-2" id="text-orgb4cd477">
</div>
<div id="outline-container-orgcc04d4b" class="outline-3">
<h3 id="orgcc04d4b">数值类型</h3>
<div class="outline-text-3" id="text-orgcc04d4b">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">type</td>
<td class="org-right">diam</td>
<td class="org-left">shape</td>
<td class="org-left">example</td>
<td class="org-left">function</td>
</tr>

<tr>
<td class="org-left">Scalar</td>
<td class="org-right">0</td>
<td class="org-left">[]</td>
<td class="org-left">[]</td>
<td class="org-left">acc</td>
</tr>

<tr>
<td class="org-left">Vector</td>
<td class="org-right">1</td>
<td class="org-left">[n,]</td>
<td class="org-left">[1.0]</td>
<td class="org-left">bias (b)</td>
</tr>

<tr>
<td class="org-left">Matrix</td>
<td class="org-right">2</td>
<td class="org-left">[n, m]</td>
<td class="org-left">[[1,2],[3,4]]</td>
<td class="org-left">weight (W)</td>
</tr>

<tr>
<td class="org-left">Tensor</td>
<td class="org-right">&gt;2</td>
<td class="org-left">[n,m,p]</td>
<td class="org-left">[[[1],[1]],[[2],[2]]]</td>
<td class="org-left">input ( [n, h, w, 3]</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-python">
<span style="color: #7590db;">a</span> = tf.constant(example)
tf.constant() &#21151;&#33021;&#31867;&#20284;&#20110;tf.convert_to_tensor()
<span style="color: #7590db;">b</span> = tf.constant(<span style="color: #2d9574;">'Hello Deep learning'</span>)
<span style="color: #7590db;">c</span> = tf.constant(<span style="color: #a45bad;">True</span>)
<span style="color: #7590db;">dtype</span>=tf.int16, int32, int64,tf.float16, tf.float32, tf.float64
tf.cast(a, tf.float64)
tf.Variable(a)&#21487;&#20197;&#28155;&#21152;a&#30340;&#21487;&#35757;&#32451;&#23646;&#24615;
tf.zeros([n,m])  tf.zeros_like(a)  == tf.zeros(a.shape)
tf.ones([n,m])   tf.ones_like(a)   == tf.ones(a.shape)
tf.fill([2,2],10)
tf.random.normal([2,2]) == tf.random.normal([2,2], mean=0, stddev=1)
tf.random.uniform(shape, minval=0,maxval=10,dtype=tf.float32)
tf.<span style="color: #4f97d7;">range</span>(10) == tf.<span style="color: #4f97d7;">range</span>(0,10, delta = 2)

</pre>
</div>
</div>
</div>
<div id="outline-container-org94b026c" class="outline-3">
<h3 id="org94b026c">Reference(,) and Segment(:)</h3>
<div class="outline-text-3" id="text-org94b026c">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #7590db;">x</span> = tf.random.normal([4,32,32,3])
x[2][1][0][1]  == x[2,1,0,1]

[start:end:step] <span style="color: #4f97d7; font-weight: bold;">for</span> each dimension.
x[1:3:2, 1:4:2, 2:4:2, 1:3:2]

</pre>
</div>
</div>
</div>

<div id="outline-container-org6b744f4" class="outline-3">
<h3 id="org6b744f4">改变视图</h3>
<div class="outline-text-3" id="text-org6b744f4">
<p>
x = tf.random.normal([4,32,32,3]) 的数据是整体贮存的，可以合法的
reshape. 从后往前合并，拆分。
</p>
</div>

<div id="outline-container-org5e5eb69" class="outline-4">
<h4 id="org5e5eb69">增加维度</h4>
<div class="outline-text-4" id="text-org5e5eb69">
<p>
增加前置维度
tf.expand<sub>dims</sub>(x, axis=0)
增加后置维度
tf.expand<sub>dims</sub>(x, axis=-1)
也可以是其他值，表示在相应的位置增加一个维度
</p>
</div>
</div>

<div id="outline-container-orgfdde96c" class="outline-4">
<h4 id="orgfdde96c">删除维度</h4>
<div class="outline-text-4" id="text-orgfdde96c">
<p>
删除前置
tf.squeeze(x, axis=0)
后置和其他位置一样，删除dia=1的维度
</p>
</div>
</div>
</div>

<div id="outline-container-org474747b" class="outline-3">
<h3 id="org474747b">交换维度</h3>
<div class="outline-text-3" id="text-org474747b">
<p>
这会改变数据的贮存顺序
x = tf.random.normal([2,32,32,3])
x = tf.transpose(x, perm=[0,3,1,2])
以前的维度下表变换为perm
</p>
</div>
</div>

<div id="outline-container-orgdb7cdae" class="outline-3">
<h3 id="orgdb7cdae">Broadcasting</h3>
</div>
<div id="outline-container-org58d2f9d" class="outline-3">
<h3 id="org58d2f9d">tile</h3>
<div class="outline-text-3" id="text-org58d2f9d">
<p>
x = tf.random.normal([4,32,32,3])
y = tf.tile(x,[2,3,3,1]) 对应维度各复制成原来的2，3，3，1倍。
</p>
</div>
</div>

<div id="outline-container-orgceea294" class="outline-3">
<h3 id="orgceea294">Concatenate &amp; Stack &amp; Split &amp; unstack</h3>
<div class="outline-text-3" id="text-orgceea294">
<p>
tf.concat([a,b],axis=0) 除了axis=0外的所有维度都应该一样
tf.stack([a,b],axis=0) a,b的所有维度应该都一样，插入的位置和
expand<sub>dims</sub>() 遵守相同规则
tf.split(x, num<sub>or</sub><sub>size</sub><sub>splits</sub>=10, axis=0) 拆分的维度不消失
tf.unstack(x, axis=0) 拆为步长为1           拆分的维度消失
</p>
</div>
</div>

<div id="outline-container-orgb57af20" class="outline-3">
<h3 id="orgb57af20">Statistik</h3>
<div class="outline-text-3" id="text-orgb57af20">
<p>
L1 Norm  \(||x_{1}|| = \sum_{i}|x_{i}|\)
tf.norm(x, ord=1)
L2 Norm  \(||x_{2}|| = \sqrt{\sum_{i}|x_{i}|^2 }\)
tf.norm(x,ord=2)
</p>

<p>
tf.reduce<sub>max</sub>(x, axis=0)
tf.reduce<sub>min</sub>()
tf.reduce<sub>mean</sub>()
tf.reduce<sub>sum</sub>()
不指明axis则是对全局求解
tf.argmax(x, axis) 
tf.argmin(x,axis) axis 轴的极值坐标
</p>

<div class="org-src-container">
<pre class="src src-python">
<span style="color: #7590db;">out</span> = tf.random.normal([100,10])
<span style="color: #7590db;">out</span> = tf.nn.softmax(out, axis=1)
<span style="color: #7590db;">pred</span> = tf.argmax(out, axis=1)
<span style="color: #7590db;">y</span> = tf.random.uniform([100],dtype=tf.int64,maxval=10)
<span style="color: #7590db;">out</span> = tf.equal(pred, y)
<span style="color: #7590db;">out</span> = tf.cast(out, dtype=tf.float32)
<span style="color: #7590db;">cor</span> = tf.reduce_sum(out)
</pre>
</div>
</div>
</div>

<div id="outline-container-org67784d8" class="outline-3">
<h3 id="org67784d8">Padding</h3>
<div class="outline-text-3" id="text-org67784d8">
<pre class="example">
x = tf.pad(x,[[0,2]]) []内是padding 填充的方案，每个[]表示一个维度
</pre>
</div>
</div>







<div id="outline-container-org8ed14de" class="outline-3">
<h3 id="org8ed14de">advance manipulation</h3>
<div class="outline-text-3" id="text-org8ed14de">
</div>
<div id="outline-container-org04e04d4" class="outline-4">
<h4 id="org04e04d4">tf.minimum</h4>
<div class="outline-text-4" id="text-org04e04d4">
<p>
tf.minimum(x, a) 最小a
tf.maximum(x, b) 最大b
tf.minimum(tf.maximum(x,2),7) == tf.clip<sub>by</sub><sub>value</sub>(x,2,7)
</p>
</div>
</div>

<div id="outline-container-org61dd24a" class="outline-4">
<h4 id="org61dd24a">tf.gather</h4>
<div class="outline-text-4" id="text-org61dd24a">
<p>
tf.gather(x, [0,2,4,5,7],axis =1) 抽取在axis=1上的[0,2,4,5,7]坐标的组
成数据，并可以重新定义组成数据的顺序
</p>
</div>
</div>
<div id="outline-container-org15b5d72" class="outline-4">
<h4 id="org15b5d72">tf.gather<sub>nd</sub></h4>
<div class="outline-text-4" id="text-org15b5d72">
<p>
tf.gather<sub>nd</sub>(x,[[1,1],[2,2],[3,3]]) 
后面根的[]说明了所有成员要操作的维度，
第一成员的第一维坐标为1，第二维坐标为1..
所有成员组成List
</p>
</div>
</div>
<div id="outline-container-org86214c5" class="outline-4">
<h4 id="org86214c5">tf.boolean<sub>mask</sub></h4>
<div class="outline-text-4" id="text-org86214c5">
<p>
tf.boolean<sub>mask</sub>(x, mask=[True, False, True, False],axis =0)
在axis=0的轴上，只有mask成员是True才会被选中，mask 长度等于axis=0 轴的
长度。
</p>
</div>
</div>
