tensorflow/tf2.org
*** tf.where
#+begin_src python
a = tf.ones([3,3])
b = tf.zeros([3,3])
cond = tf.constant([True,False,False],[False, True, True],[False, False, False])
c = tf.where(cond, a,b)
#+end_src
tf.where(cond) 返回所有值为True元素的下标
#+begin_src  python
x = tf.random.normal([3.3])
mask = x>0
ind = tf.where(mask)
a = tf.gather_nd(x,ind)
#+end_src
*** tf.scatter_nd
在一个长度为8的空白向量（全为0）里，将updates按照indices的位置写入
#+begin_src python
indices = tf.constant([[4],[3],[2],[1]])
updates = tf.constant([3,1,0,2])
tf.scatter_nd(indices, updates, [8])

#+end_src

*** tf.meshgrid
#+begin_src python
x = tf.linspace(-8., 8, 100)   #-8后面的. 不能省略
y = tf.linspace(-8., 8, 100)
x.shape = 100
x, y = tf.meshgrid(x,y)
x.shape = [100,100]
ax.contour3D(x.numpy(), y.numpy(), z.numpy(), 50)

#+end_src


* activation function
** no activation
输出为实数空间或某个区间， 连续变化。直接有输出值和真实值比较
** Sigmoid
$$ Sigmoid(x) = \frac{1}{1+e^{-x}}$$

导数：$$ \sigma'(x) = \sigma(x)(1-\sigma(x))$$

** ReLU
$$ Relu(x) = 
\begin{cases}
x&  x >=0 \\
0&  x < 0
\end{cases}$$

$$ Relu(x) = max(0,x)$$

** LeakyReLU

$$ LeakyReLU(x) = 
\begin{cases}
x& x >=0 \\
px& x <0, 0<p<<1
\end{cases}$$

** Tanh
$$ tanh(x) = \frac{e^{x}-e^{-x}}{e^{x}+e^{-x}}$$
$$ tanh(x) = 2.sigmoid(2x)-1$$
导数：$$\tanh'(x) = 1- \tanh^{2}(x)$$

** MSE
$$ \mathcal{L} = MSE(y, o) =
\frac{1}{d_{out}}\sum_{i=1}^{d_{out}}(y_{i}-o^{i})^{2}$$
导数 ：$$ \frac{\partial \mathcal{L}}{\partial o_{i}}= (o_{i}-y_{i})$$

** inf entropy 
$$ H(p) = -\sum_{i}P(i)\log_{2}^{P_{i}}$$
** softmax
$$ p_{z_{i}} = \frac{e^{z_{i}}}{\sum_{j}e^{z_{j}}}$$
所有种类的概率之和为1
导数:
$$ \frac{ \partial p_{z_{i}}}{\partial z_{j}} = 
\begin{cases}
p_{i}(1-p_{j}) &  if i =j \\
-p_{i}p_{j}    & if \neq j
\end{cases}$$

** cross entropy
在计算交叉熵时， 一般是和 softmax 函数一起使用的
$$ H(p||q) = -\sum_{i} p(i) \log_{2}^{q_{i}}$$
$$H(p||q) = H(p) + D_{KL}(p||q)$$

for One-hot coding
$$ H(p||q) = D_{KL}(p||q) = \sum_{i}y_{i}log(\frac{y_{j}}{o_{j}}) = 
1 \cdot \log\frac{1}{o_{i}} + \sum_{j!=i}0 \cdot \log \frac{0}{o_{j}}
= -\log o_{i}$$
o_i 为1 时，预测正确，交叉熵为0。
导数：
$$ \mathcal{L} = -\sum_{k}y_{k}\log(p_{k})$$
$$\begin{aligned}
 \frac{\partial \mathcal{L}}{\partial z_{i}} & =
-\sum_{k} y_{k} \frac{\partial \log(p_{k})}{\partial z_{i}} \\
&= -\sum_{k} y_{k} \frac{\partial \log(p_{k})}{\partial p_{k}} \cdot
\frac{\partial p_{k}}{\partial z_{i}} \\
&= -\sum_{k} y_{k} \frac{1}{\partial p_{k}} \cdot
\frac{\partial p_{k}}{\partial z_{i}} \\
\end{aligned}
$$

用上面 softmax 的导数结果，分为k=i 和k!=i两种情况
$$ \frac{\partial \mathcal{L}}{z_{i}}=p_{i}-y_{i}$$

* Backpropagation

** 感知机
对x的向后更正，$x^{'}= x - \eta \cdot \frac{dy}{dx}$.
对于感知机的传递功能，$y = w^{T}x + b$.
由于感知机没有激活函数，所以直接对$$\mathcal{L} = \frac{1}{n}
\sum^{n}_{i=1}(w\cdot x^{i} +b -y^{i})^{2}$$.
$$ \frac{\partial \mathcal{L}}{\partial w} = \frac{2}{n}
\sum^{n}_{i=1}(wx^{i}+b-y^{i})x^{i}$$
$$ \frac{\partial \mathcal{L}}{\partial b}= \frac{2}{n}\sum^{n}_{i=1}(wx^{i}+b -y^{i})$$

** 多层神经网络

而对于多层神经网络，$z = w^{T}x + b$, $\frac{\partial z}{\partial w} =x$,  $\frac{\partial z}{\partial b} = 1$.
每层之间具有激活函数, $\sigma(z) = \frac{1}{1-e^{-z}}$,$\frac{\partial \sigma(x)}{\partial x} = \sigma (1-\sigma)$.
损失函数, $\mathcal{L} = \frac{1}{2}(\sigma - y^{i})^{2}$, $$\frac{\partial \mathcal{L}}{\partial \sigma} = (\sigma -y^{i})$$


$$\frac{\partial \mathcal{L}}{\partial w} = \frac{\partial
\mathcal{L}}{\partial \sigma} \cdot \frac{\partial \sigma }{\partial z} \cdot
\frac{\partial z}{\partial w}$$


$\frac{\partial \mathcal{L}}{\partial w} = (\sigma -
y)\sigma(1-\sigma) \cdot x$

$$\frac{\partial \mathcal{L}}{\partial b} = \frac{\partial
\mathcal{L}}{\partial \sigma} \cdot \frac{\partial \sigma }{\partial z} \cdot
\frac{\partial z}{\partial b}$$

$\frac{\partial  \mathcal{L}}{\partial b} = (\sigma -
y)\sigma(1-\sigma)$

如果对于多层神经网络，则需要逐层计算，其中$\frac{\partial
\mathcal{L}}{\partial w}$ 中的w就是相应层的权重，由最后的
L逐步回推到w。

