tensorflow/tf2.html
<div id="outline-container-orgd83a9d4" class="outline-4">
<h4 id="orgd83a9d4">tf.where</h4>
<div class="outline-text-4" id="text-orgd83a9d4">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #7590db;">a</span> = tf.ones([3,3])
<span style="color: #7590db;">b</span> = tf.zeros([3,3])
<span style="color: #7590db;">cond</span> = tf.constant([<span style="color: #a45bad;">True</span>,<span style="color: #a45bad;">False</span>,<span style="color: #a45bad;">False</span>],[<span style="color: #a45bad;">False</span>, <span style="color: #a45bad;">True</span>, <span style="color: #a45bad;">True</span>],[<span style="color: #a45bad;">False</span>, <span style="color: #a45bad;">False</span>, <span style="color: #a45bad;">False</span>])
<span style="color: #7590db;">c</span> = tf.where(cond, a,b)
</pre>
</div>
<p>
tf.where(cond) 返回所有值为True元素的下标
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #7590db;">x</span> = tf.random.normal([3.3])
<span style="color: #7590db;">mask</span> = x&gt;0
<span style="color: #7590db;">ind</span> = tf.where(mask)
<span style="color: #7590db;">a</span> = tf.gather_nd(x,ind)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd139fc8" class="outline-4">
<h4 id="orgd139fc8">tf.scatter<sub>nd</sub></h4>
<div class="outline-text-4" id="text-orgd139fc8">
<p>
在一个长度为8的空白向量（全为0）里，将updates按照indices的位置写入
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #7590db;">indices</span> = tf.constant([[4],[3],[2],[1]])
<span style="color: #7590db;">updates</span> = tf.constant([3,1,0,2])
tf.scatter_nd(indices, updates, [8])

</pre>
</div>
</div>
</div>

<div id="outline-container-org94aece7" class="outline-4">
<h4 id="org94aece7">tf.meshgrid</h4>
<div class="outline-text-4" id="text-org94aece7">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #7590db;">x</span> = tf.linspace(-8., 8, 100)   <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">-8&#21518;&#38754;&#30340;. &#19981;&#33021;&#30465;&#30053;</span>
<span style="color: #7590db;">y</span> = tf.linspace(-8., 8, 100)
<span style="color: #7590db;">x.shape</span> = 100
<span style="color: #7590db;">x</span>, <span style="color: #7590db;">y</span> = tf.meshgrid(x,y)
<span style="color: #7590db;">x.shape</span> = [100,100]
ax.contour3D(x.numpy(), y.numpy(), z.numpy(), 50)

</pre>
</div>
</div>
</div>
</div>
</div>


<div id="outline-container-orgf39c541" class="outline-2">
<h2 id="orgf39c541">activation function</h2>
<div class="outline-text-2" id="text-orgf39c541">
</div>
<div id="outline-container-org76d1e1c" class="outline-3">
<h3 id="org76d1e1c">no activation</h3>
<div class="outline-text-3" id="text-org76d1e1c">
<p>
输出为实数空间或某个区间， 连续变化。直接有输出值和真实值比较
</p>
</div>
</div>
<div id="outline-container-org52e7357" class="outline-3">
<h3 id="org52e7357">Sigmoid</h3>
<div class="outline-text-3" id="text-org52e7357">
<p>
\[ Sigmoid(x) = \frac{1}{1+e^{-x}}\]
</p>

<p>
导数：\[ \sigma'(x) = \sigma(x)(1-\sigma(x))\]
</p>
</div>
</div>

<div id="outline-container-org913dddc" class="outline-3">
<h3 id="org913dddc">ReLU</h3>
<div class="outline-text-3" id="text-org913dddc">
<p>
\[ Relu(x) = 
\begin{cases}
x&  x >=0 \\
0&  x < 0
\end{cases}\]
</p>

<p>
\[ Relu(x) = max(0,x)\]
</p>
</div>
</div>

<div id="outline-container-orgc0560b9" class="outline-3">
<h3 id="orgc0560b9">LeakyReLU</h3>
<div class="outline-text-3" id="text-orgc0560b9">
<p>
\[ LeakyReLU(x) = 
\begin{cases}
x& x >=0 \\
px& x <0, 0<p<<1
\end{cases}\]
</p>
</div>
</div>

<div id="outline-container-orgd2ecd24" class="outline-3">
<h3 id="orgd2ecd24">Tanh</h3>
<div class="outline-text-3" id="text-orgd2ecd24">
<p>
\[ tanh(x) = \frac{e^{x}-e^{-x}}{e^{x}+e^{-x}}\]
\[ tanh(x) = 2.sigmoid(2x)-1\]
导数：\[\tanh'(x) = 1- \tanh^{2}(x)\]
</p>
</div>
</div>

<div id="outline-container-org109efa9" class="outline-3">
<h3 id="org109efa9">MSE</h3>
<div class="outline-text-3" id="text-org109efa9">
<p>
\[ \mathcal{L} = MSE(y, o) =
\frac{1}{d_{out}}\sum_{i=1}^{d_{out}}(y_{i}-o^{i})^{2}\]
导数 ：\[ \frac{\partial \mathcal{L}}{\partial o_{i}}= (o_{i}-y_{i})\]
</p>
</div>
</div>

<div id="outline-container-orga9f2ba1" class="outline-3">
<h3 id="orga9f2ba1">inf entropy</h3>
<div class="outline-text-3" id="text-orga9f2ba1">
<p>
\[ H(p) = -\sum_{i}P(i)\log_{2}^{P_{i}}\]
</p>
</div>
</div>
<div id="outline-container-org4176fba" class="outline-3">
<h3 id="org4176fba">softmax</h3>
<div class="outline-text-3" id="text-org4176fba">
<p>
\[ p_{z_{i}} = \frac{e^{z_{i}}}{\sum_{j}e^{z_{j}}}\]
所有种类的概率之和为1
导数:
\[ \frac{ \partial p_{z_{i}}}{\partial z_{j}} = 
\begin{cases}
p_{i}(1-p_{j}) &  if i =j \\
-p_{i}p_{j}    & if \neq j
\end{cases}\]
</p>
</div>
</div>

<div id="outline-container-org56c7e7f" class="outline-3">
<h3 id="org56c7e7f">cross entropy</h3>
<div class="outline-text-3" id="text-org56c7e7f">
<p>
在计算交叉熵时， 一般是和 softmax 函数一起使用的
\[ H(p||q) = -\sum_{i} p(i) \log_{2}^{q_{i}}\]
\[H(p||q) = H(p) + D_{KL}(p||q)\]
</p>

<p>
for One-hot coding
\[ H(p||q) = D_{KL}(p||q) = \sum_{i}y_{i}log(\frac{y_{j}}{o_{j}}) = 
1 \cdot \log\frac{1}{o_{i}} + \sum_{j!=i}0 \cdot \log \frac{0}{o_{j}}
= -\log o_{i}\]
o<sub>i</sub> 为1 时，预测正确，交叉熵为0。
导数：
\[ \mathcal{L} = -\sum_{k}y_{k}\log(p_{k})\]
\[\begin{aligned}
 \frac{\partial \mathcal{L}}{\partial z_{i}} & =
-\sum_{k} y_{k} \frac{\partial \log(p_{k})}{\partial z_{i}} \\
&= -\sum_{k} y_{k} \frac{\partial \log(p_{k})}{\partial p_{k}} \cdot
\frac{\partial p_{k}}{\partial z_{i}} \\
&= -\sum_{k} y_{k} \frac{1}{\partial p_{k}} \cdot
\frac{\partial p_{k}}{\partial z_{i}} \\
\end{aligned}
\]
</p>

<p>
用上面 softmax 的导数结果，分为k=i 和k!=i两种情况
\[ \frac{\partial \mathcal{L}}{z_{i}}=p_{i}-y_{i}\]
</p>
</div>
</div>
</div>

<div id="outline-container-org3c874aa" class="outline-2">
<h2 id="org3c874aa">Backpropagation</h2>
<div class="outline-text-2" id="text-org3c874aa">
</div>
<div id="outline-container-org4cdb1fd" class="outline-3">
<h3 id="org4cdb1fd">感知机</h3>
<div class="outline-text-3" id="text-org4cdb1fd">
<p>
对x的向后更正，\(x^{'}= x - \eta \cdot \frac{dy}{dx}\).
对于感知机的传递功能，\(y = w^{T}x + b\).
由于感知机没有激活函数，所以直接对\[\mathcal{L} = \frac{1}{n}
\sum^{n}_{i=1}(w\cdot x^{i} +b -y^{i})^{2}\].
\[ \frac{\partial \mathcal{L}}{\partial w} = \frac{2}{n}
\sum^{n}_{i=1}(wx^{i}+b-y^{i})x^{i}\]
\[ \frac{\partial \mathcal{L}}{\partial b}= \frac{2}{n}\sum^{n}_{i=1}(wx^{i}+b -y^{i})\]
</p>
</div>
</div>

<div id="outline-container-orgc1a2280" class="outline-3">
<h3 id="orgc1a2280">多层神经网络</h3>
<div class="outline-text-3" id="text-orgc1a2280">
<p>
而对于多层神经网络，\(z = w^{T}x + b\), \(\frac{\partial z}{\partial w} =x\),  \(\frac{\partial z}{\partial b} = 1\).
每层之间具有激活函数, \(\sigma(z) = \frac{1}{1-e^{-z}}\),\(\frac{\partial \sigma(x)}{\partial x} = \sigma (1-\sigma)\).
损失函数, \(\mathcal{L} = \frac{1}{2}(\sigma - y^{i})^{2}\), \[\frac{\partial \mathcal{L}}{\partial \sigma} = (\sigma -y^{i})\]
</p>


<p>
\[\frac{\partial \mathcal{L}}{\partial w} = \frac{\partial
\mathcal{L}}{\partial \sigma} \cdot \frac{\partial \sigma }{\partial z} \cdot
\frac{\partial z}{\partial w}\]
</p>


<p>
\(\frac{\partial \mathcal{L}}{\partial w} = (\sigma -
y)\sigma(1-\sigma) \cdot x\)
</p>

<p>
\[\frac{\partial \mathcal{L}}{\partial b} = \frac{\partial
\mathcal{L}}{\partial \sigma} \cdot \frac{\partial \sigma }{\partial z} \cdot
\frac{\partial z}{\partial b}\]
</p>

<p>
\(\frac{\partial  \mathcal{L}}{\partial b} = (\sigma -
y)\sigma(1-\sigma)\)
</p>

<p>
如果对于多层神经网络，则需要逐层计算，其中\(\frac{\partial
\mathcal{L}}{\partial w}\) 中的w就是相应层的权重，由最后的
L逐步回推到w。
</p>
</div>
</div>
</div>
