tensorflow/tf2.org
* Make_moons

all import 
#+begin_src python  :session make_moons
  import seaborn as sns
  import matplotlib.pyplot as plt
  #+end_src
#+RESULTS:


generate the data
#+begin_src python  :results output :session make_moons  
  from sklearn.datasets import make_moons
  from sklearn.model_selection import train_test_split
  N_samples = 2000
  Test_size = 0.3
  X, y = make_moons(n_samples = N_samples, noise = 0.2, random_state=100)
  X_train, X_test, y_train, y_test = train_test_split(X, y,test_size = Test_size, random_state = 42)
  print(X.shape, y.shape)
  def make_plot(X, y, plot_name, file_name=None, XX=None, YY=None, preds=None,dark=False):
      if(dark):
          plt.style.use('dark_background')
      else:
          sns.set_style("whitegrid")
      plt.figure(figsize=(16,12))
      axes = plt.gca()
      axes.set(xlabel="$x_1$", ylabel="$x_2$")
      plt.title(plot_name,fontsize=30)
      plt.subplots_adjust(left=0.20)
      plt.subplots_adjust(right=0.8)
      if(XX is not None and YY is not None and preds is not None):
          plt.contourf(XX,YY,preds.reshape(XX.shape), 25, alpha=1,cmap = cm.Spectral)
          plt.contour(XX,YY, preds.reshape(XX.shape), levels=[.5],cmap="Greys", vmin=0,vmax=0.6)
          plt.scatter(X[:,0],X[:,1],c=y.ravel(), s=40, cmap=plt.cm.Spectral,edgecolors='none')
          plt.savefig('data.svg')
          plt.close()
  make_plot(X,y,None,"Classification Dataset Visualization")
#+end_src
#+RESULTS:
: (2000, 2) (2000,)


generate the  signal Layer class
#+begin_src python :session make_moons
  class Layer:
      def __init__(self, n_input, n_neurons,activation=None, weight=None,bias=None):
          self.weight = weight if weight is not None else np.random.randn(n_input,n_neurons)*np.sqrt(1/n_neurons)
          self.bias = bias if bias is not None else np.random.rand(n_neurons)*0.1
          self.activation = activation
          self.last_activation = None
          self.error = None
          self.delta = None
      def activate(self,x):
          r = np.dot(x, self.weight)+self.bias
          self.last_activation = self._apply_activation(r)
          return self.last_activation
      def _apply_activation(self, r):
          if self.activation is None:
              return r
          elif self.activation == 'relu':
              return np.maximum(r,0)
          elif self.activation == 'tanh':
              return np.tanh(r)
          elif self.activation == 'sigmoid':
              return 1/(1+np.exp(-r))
          return r
      def apply_activation_derivative(self, r):
          if self.activation is None:
              return np.ones_like(r)
          elif self.activation == 'relu':
              grad = np.array(r, copy=True)
              grad[r>0] = 1.
              grad[r<=0] =0.
              return grad
          elif self.activation == 'tanh':
              return 1-r**2
          elif self.activation == 'sigmoid':
              return r*(1-r)
          return r
            
#+end_src
#+RESULTS:
| 2000 | 2 |

generate the multi Layers Class NeuralNetwork
#+begin_src python :session make_moons
  class NeuralNetwork:
      def __init__(self):
          self._layers = []
      def add_layer(self, layer):
          self._layers.append(layer)
      def feed_forward(self, X):
          for layer in self._layers:
              X = layer.activate(X)
          return X

      def backpropagation(self, X, y,learning_rate):
          output = self.feed_forward(X)
          for i in reversed(range(len(self._layers))):
              layer = self._layers[i]
              if layer == self._layers[-1]:
                  layer.error = y-output
                  layer.delta = layer.error*layer.apply_activation_derivative(output)
              else:
                  next_layer = self._layers[i+1]
                  layer.error = np.dot(next_layer.weights, next_layer.delta)
                  layer.delta = layer.error*layer.apply_activation_derivative(layer.last_activation)

          for i in range(len(self._layers)):
              layer = self._layers[i]
              o_i = np.atleast_2d(X if i == 0 else  self._layers[i-1].last_activation)
              layer.weights += layer.delta*o_i.T*learning_rate


      def train(self, X_train, X_test, y_train, y_test, learning_rate, max_epochs):
          y_onehot = np.zeros((y_train.shape[0],2))
          y_onehot[np.arange(y_train.shape[0]),y_train] =1
          mses = []
          for i in range(max_epochs):
              for j in range(len(X_train)):
                  self.backpropagation(X_train[j], y_onehot[j], learning_rate)
              if i%10 == 0:
                  mse = np.mean(np.square(y_onehot - self.feed_forward(X_train)))
                  mses.apply(mse)
                  print('Epoch : #%s, MSE: %f' %(i, float(mse)))
                  print('Accuracy: %.2f%%' %(self.accuracy(self.predict(X_test),y_test.flatten())*100))
          return mses


#+end_src
#+RESULTS:

#+begin_src  python :session make_moons
nn = Neuralnetwork()
nn.add_layer(Layer (2, 25, 'sigmoid'))
nn.add_layer(Layer(25, 50, 'sigmoid'))
nn.add_layer(Layer(50, 25, 'sigmoid'))
nn.add_layer(Layer(25, 2, 'sigmoid'))
nn.backpropagation(X_train,y_train,0.001)
nn.train(X_train, X_test, y_train, y_test, 0.001,20)


#+end_src
#+RESULTS:

different Layers
#+begin_src python :session make_moons
  for n in range(5):
      model = Sequential()
      model.add(Dense(8,input_dim=2,activation='relu'))
      for _ in range(n):
          model.add(Dense(32,activation='relu'))
      model.add(Dense(1,activation='sigmoid'))
      model.compile(loss='binary_crossentropy',optimizer='adam',metrics=['accuracy'])
      history = model.fit(X_train,y_train,epochs = 20, verbose=1)
      preds = model.predict_classes(np.c_[XX.ravel(), YY_ravel()])
      title = "网络层数({})".format(n)
      file = "网络容量 %f.png" %(2+n*1)
      make_plot(X_train,y_train, title,file,XX,YY,preds)
    

#+end_src

#+RESULTS:

