tensorflow/tf2.html

<div id="outline-container-org2b617fd" class="outline-2">
<h2 id="org2b617fd">Make<sub>moons</sub></h2>
<div class="outline-text-2" id="text-org2b617fd">
<p>
all import 
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> seaborn <span style="color: #4f97d7; font-weight: bold;">as</span> sns
<span style="color: #4f97d7; font-weight: bold;">import</span> matplotlib.pyplot <span style="color: #4f97d7; font-weight: bold;">as</span> plt
</pre>
</div>


<p>
generate the data
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">from</span> sklearn.datasets <span style="color: #4f97d7; font-weight: bold;">import</span> make_moons
<span style="color: #4f97d7; font-weight: bold;">from</span> sklearn.model_selection <span style="color: #4f97d7; font-weight: bold;">import</span> train_test_split
<span style="color: #7590db;">N_samples</span> = 2000
<span style="color: #7590db;">Test_size</span> = 0.3
<span style="color: #7590db;">X</span>, <span style="color: #7590db;">y</span> = make_moons(n_samples = N_samples, noise = 0.2, random_state=100)
<span style="color: #7590db;">X_train</span>, <span style="color: #7590db;">X_test</span>, <span style="color: #7590db;">y_train</span>, <span style="color: #7590db;">y_test</span> = train_test_split(X, y,test_size = Test_size, random_state = 42)
<span style="color: #4f97d7; font-weight: bold;">print</span>(X.shape, y.shape)
<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">make_plot</span>(X, y, plot_name, file_name=<span style="color: #a45bad;">None</span>, XX=<span style="color: #a45bad;">None</span>, YY=<span style="color: #a45bad;">None</span>, preds=<span style="color: #a45bad;">None</span>,dark=<span style="color: #a45bad;">False</span>):
    <span style="color: #4f97d7; font-weight: bold;">if</span>(dark):
        plt.style.use(<span style="color: #2d9574;">'dark_background'</span>)
    <span style="color: #4f97d7; font-weight: bold;">else</span>:
        sns.set_style(<span style="color: #2d9574;">"whitegrid"</span>)
    plt.figure(figsize=(16,12))
    <span style="color: #7590db;">axes</span> = plt.gca()
    axes.<span style="color: #4f97d7;">set</span>(xlabel=<span style="color: #2d9574;">"$x_1$"</span>, ylabel=<span style="color: #2d9574;">"$x_2$"</span>)
    plt.title(plot_name,fontsize=30)
    plt.subplots_adjust(left=0.20)
    plt.subplots_adjust(right=0.8)
    <span style="color: #4f97d7; font-weight: bold;">if</span>(XX <span style="color: #4f97d7; font-weight: bold;">is</span> <span style="color: #4f97d7; font-weight: bold;">not</span> <span style="color: #a45bad;">None</span> <span style="color: #4f97d7; font-weight: bold;">and</span> YY <span style="color: #4f97d7; font-weight: bold;">is</span> <span style="color: #4f97d7; font-weight: bold;">not</span> <span style="color: #a45bad;">None</span> <span style="color: #4f97d7; font-weight: bold;">and</span> preds <span style="color: #4f97d7; font-weight: bold;">is</span> <span style="color: #4f97d7; font-weight: bold;">not</span> <span style="color: #a45bad;">None</span>):
        plt.contourf(XX,YY,preds.reshape(XX.shape), 25, alpha=1,cmap = cm.Spectral)
        plt.contour(XX,YY, preds.reshape(XX.shape), levels=[.5],cmap=<span style="color: #2d9574;">"Greys"</span>, vmin=0,vmax=0.6)
        plt.scatter(X[:,0],X[:,1],c=y.ravel(), s=40, cmap=plt.cm.Spectral,edgecolors=<span style="color: #2d9574;">'none'</span>)
        plt.savefig(<span style="color: #2d9574;">'data.svg'</span>)
        plt.close()
make_plot(X,y,<span style="color: #a45bad;">None</span>,<span style="color: #2d9574;">"Classification Dataset Visualization"</span>)
</pre>
</div>


<p>
generate the  signal Layer class
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">Layer</span>:
    <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">__init__</span>(<span style="color: #4f97d7; font-weight: bold;">self</span>, n_input, n_neurons,activation=<span style="color: #a45bad;">None</span>, weight=<span style="color: #a45bad;">None</span>,bias=<span style="color: #a45bad;">None</span>):
        <span style="color: #4f97d7; font-weight: bold;">self</span>.weight = weight <span style="color: #4f97d7; font-weight: bold;">if</span> weight <span style="color: #4f97d7; font-weight: bold;">is</span> <span style="color: #4f97d7; font-weight: bold;">not</span> <span style="color: #a45bad;">None</span> <span style="color: #4f97d7; font-weight: bold;">else</span> np.random.randn(n_input,n_neurons)*np.sqrt(1/n_neurons)
        <span style="color: #4f97d7; font-weight: bold;">self</span>.bias = bias <span style="color: #4f97d7; font-weight: bold;">if</span> bias <span style="color: #4f97d7; font-weight: bold;">is</span> <span style="color: #4f97d7; font-weight: bold;">not</span> <span style="color: #a45bad;">None</span> <span style="color: #4f97d7; font-weight: bold;">else</span> np.random.rand(n_neurons)*0.1
        <span style="color: #4f97d7; font-weight: bold;">self</span>.activation = activation
        <span style="color: #4f97d7; font-weight: bold;">self</span>.last_activation = <span style="color: #a45bad;">None</span>
        <span style="color: #4f97d7; font-weight: bold;">self</span>.error = <span style="color: #a45bad;">None</span>
        <span style="color: #4f97d7; font-weight: bold;">self</span>.delta = <span style="color: #a45bad;">None</span>
    <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">activate</span>(<span style="color: #4f97d7; font-weight: bold;">self</span>,x):
        <span style="color: #7590db;">r</span> = np.dot(x, <span style="color: #4f97d7; font-weight: bold;">self</span>.weight)+<span style="color: #4f97d7; font-weight: bold;">self</span>.bias
        <span style="color: #4f97d7; font-weight: bold;">self</span>.last_activation = <span style="color: #4f97d7; font-weight: bold;">self</span>._apply_activation(r)
        <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #4f97d7; font-weight: bold;">self</span>.last_activation
    <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">_apply_activation</span>(<span style="color: #4f97d7; font-weight: bold;">self</span>, r):
        <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #4f97d7; font-weight: bold;">self</span>.activation <span style="color: #4f97d7; font-weight: bold;">is</span> <span style="color: #a45bad;">None</span>:
            <span style="color: #4f97d7; font-weight: bold;">return</span> r
        <span style="color: #4f97d7; font-weight: bold;">elif</span> <span style="color: #4f97d7; font-weight: bold;">self</span>.activation == <span style="color: #2d9574;">'relu'</span>:
            <span style="color: #4f97d7; font-weight: bold;">return</span> np.maximum(r,0)
        <span style="color: #4f97d7; font-weight: bold;">elif</span> <span style="color: #4f97d7; font-weight: bold;">self</span>.activation == <span style="color: #2d9574;">'tanh'</span>:
            <span style="color: #4f97d7; font-weight: bold;">return</span> np.tanh(r)
        <span style="color: #4f97d7; font-weight: bold;">elif</span> <span style="color: #4f97d7; font-weight: bold;">self</span>.activation == <span style="color: #2d9574;">'sigmoid'</span>:
            <span style="color: #4f97d7; font-weight: bold;">return</span> 1/(1+np.exp(-r))
        <span style="color: #4f97d7; font-weight: bold;">return</span> r
    <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">apply_activation_derivative</span>(<span style="color: #4f97d7; font-weight: bold;">self</span>, r):
        <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #4f97d7; font-weight: bold;">self</span>.activation <span style="color: #4f97d7; font-weight: bold;">is</span> <span style="color: #a45bad;">None</span>:
            <span style="color: #4f97d7; font-weight: bold;">return</span> np.ones_like(r)
        <span style="color: #4f97d7; font-weight: bold;">elif</span> <span style="color: #4f97d7; font-weight: bold;">self</span>.activation == <span style="color: #2d9574;">'relu'</span>:
            <span style="color: #7590db;">grad</span> = np.array(r, copy=<span style="color: #a45bad;">True</span>)
            <span style="color: #7590db;">grad</span>[r&gt;0] = 1.
            <span style="color: #7590db;">grad</span>[r&lt;=0] =0.
            <span style="color: #4f97d7; font-weight: bold;">return</span> grad
        <span style="color: #4f97d7; font-weight: bold;">elif</span> <span style="color: #4f97d7; font-weight: bold;">self</span>.activation == <span style="color: #2d9574;">'tanh'</span>:
            <span style="color: #4f97d7; font-weight: bold;">return</span> 1-r**2
        <span style="color: #4f97d7; font-weight: bold;">elif</span> <span style="color: #4f97d7; font-weight: bold;">self</span>.activation == <span style="color: #2d9574;">'sigmoid'</span>:
            <span style="color: #4f97d7; font-weight: bold;">return</span> r*(1-r)
        <span style="color: #4f97d7; font-weight: bold;">return</span> r

</pre>
</div>

<p>
generate the multi Layers Class NeuralNetwork
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">NeuralNetwork</span>:
    <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">__init__</span>(<span style="color: #4f97d7; font-weight: bold;">self</span>):
        <span style="color: #4f97d7; font-weight: bold;">self</span>._layers = []
    <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">add_layer</span>(<span style="color: #4f97d7; font-weight: bold;">self</span>, layer):
        <span style="color: #4f97d7; font-weight: bold;">self</span>._layers.append(layer)
    <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">feed_forward</span>(<span style="color: #4f97d7; font-weight: bold;">self</span>, X):
        <span style="color: #4f97d7; font-weight: bold;">for</span> layer <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7; font-weight: bold;">self</span>._layers:
            <span style="color: #7590db;">X</span> = layer.activate(X)
        <span style="color: #4f97d7; font-weight: bold;">return</span> X

    <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">backpropagation</span>(<span style="color: #4f97d7; font-weight: bold;">self</span>, X, y,learning_rate):
        <span style="color: #7590db;">output</span> = <span style="color: #4f97d7; font-weight: bold;">self</span>.feed_forward(X)
        <span style="color: #4f97d7; font-weight: bold;">for</span> i <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">reversed</span>(<span style="color: #4f97d7;">range</span>(<span style="color: #4f97d7;">len</span>(<span style="color: #4f97d7; font-weight: bold;">self</span>._layers))):
            <span style="color: #7590db;">layer</span> = <span style="color: #4f97d7; font-weight: bold;">self</span>._layers[i]
            <span style="color: #4f97d7; font-weight: bold;">if</span> layer == <span style="color: #4f97d7; font-weight: bold;">self</span>._layers[-1]:
                <span style="color: #7590db;">layer.error</span> = y-output
                <span style="color: #7590db;">layer.delta</span> = layer.error*layer.apply_activation_derivative(output)
            <span style="color: #4f97d7; font-weight: bold;">else</span>:
                <span style="color: #7590db;">next_layer</span> = <span style="color: #4f97d7; font-weight: bold;">self</span>._layers[i+1]
                <span style="color: #7590db;">layer.error</span> = np.dot(next_layer.weights, next_layer.delta)
                <span style="color: #7590db;">layer.delta</span> = layer.error*layer.apply_activation_derivative(layer.last_activation)

        <span style="color: #4f97d7; font-weight: bold;">for</span> i <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(<span style="color: #4f97d7;">len</span>(<span style="color: #4f97d7; font-weight: bold;">self</span>._layers)):
            <span style="color: #7590db;">layer</span> = <span style="color: #4f97d7; font-weight: bold;">self</span>._layers[i]
            <span style="color: #7590db;">o_i</span> = np.atleast_2d(X <span style="color: #4f97d7; font-weight: bold;">if</span> i == 0 <span style="color: #4f97d7; font-weight: bold;">else</span>  <span style="color: #4f97d7; font-weight: bold;">self</span>._layers[i-1].last_activation)
            <span style="color: #7590db;">layer.weights</span> += layer.delta*o_i.T*learning_rate


    <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">train</span>(<span style="color: #4f97d7; font-weight: bold;">self</span>, X_train, X_test, y_train, y_test, learning_rate, max_epochs):
        <span style="color: #7590db;">y_onehot</span> = np.zeros((y_train.shape[0],2))
        y_onehot[np.arange(y_train.shape[0]),y_train] =1
        <span style="color: #7590db;">mses</span> = []
        <span style="color: #4f97d7; font-weight: bold;">for</span> i <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(max_epochs):
            <span style="color: #4f97d7; font-weight: bold;">for</span> j <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(<span style="color: #4f97d7;">len</span>(X_train)):
                <span style="color: #4f97d7; font-weight: bold;">self</span>.backpropagation(X_train[j], y_onehot[j], learning_rate)
            <span style="color: #4f97d7; font-weight: bold;">if</span> i%10 == 0:
                <span style="color: #7590db;">mse</span> = np.mean(np.square(y_onehot - <span style="color: #4f97d7; font-weight: bold;">self</span>.feed_forward(X_train)))
                mses.<span style="color: #4f97d7;">apply</span>(mse)
                <span style="color: #4f97d7; font-weight: bold;">print</span>(<span style="color: #2d9574;">'Epoch : #%s, MSE: %f'</span> %(i, <span style="color: #4f97d7;">float</span>(mse)))
                <span style="color: #4f97d7; font-weight: bold;">print</span>(<span style="color: #2d9574;">'Accuracy: %.2f%%'</span> %(<span style="color: #4f97d7; font-weight: bold;">self</span>.accuracy(<span style="color: #4f97d7; font-weight: bold;">self</span>.predict(X_test),y_test.flatten())*100))
        <span style="color: #4f97d7; font-weight: bold;">return</span> mses


</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #7590db;">nn</span> = Neuralnetwork()
nn.add_layer(Layer (2, 25, <span style="color: #2d9574;">'sigmoid'</span>))
nn.add_layer(Layer(25, 50, <span style="color: #2d9574;">'sigmoid'</span>))
nn.add_layer(Layer(50, 25, <span style="color: #2d9574;">'sigmoid'</span>))
nn.add_layer(Layer(25, 2, <span style="color: #2d9574;">'sigmoid'</span>))
nn.backpropagation(X_train,y_train,0.001)
nn.train(X_train, X_test, y_train, y_test, 0.001,20)


</pre>
</div>

<p>
different Layers
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">for</span> n <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(5):
    <span style="color: #7590db;">model</span> = Sequential()
    model.add(Dense(8,input_dim=2,activation=<span style="color: #2d9574;">'relu'</span>))
    <span style="color: #4f97d7; font-weight: bold;">for</span> _ <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(n):
        model.add(Dense(32,activation=<span style="color: #2d9574;">'relu'</span>))
    model.add(Dense(1,activation=<span style="color: #2d9574;">'sigmoid'</span>))
    model.<span style="color: #4f97d7;">compile</span>(loss=<span style="color: #2d9574;">'binary_crossentropy'</span>,optimizer=<span style="color: #2d9574;">'adam'</span>,metrics=[<span style="color: #2d9574;">'accuracy'</span>])
    <span style="color: #7590db;">history</span> = model.fit(X_train,y_train,epochs = 20, verbose=1)
    <span style="color: #7590db;">preds</span> = model.predict_classes(np.c_[XX.ravel(), YY_ravel()])
    <span style="color: #7590db;">title</span> = <span style="color: #2d9574;">"&#32593;&#32476;&#23618;&#25968;({})"</span>.<span style="color: #4f97d7;">format</span>(n)
    <span style="color: #4f97d7;">file</span> = <span style="color: #2d9574;">"&#32593;&#32476;&#23481;&#37327; %f.png"</span> %(2+n*1)
    make_plot(X_train,y_train, title,<span style="color: #4f97d7;">file</span>,XX,YY,preds)


</pre>
</div>
</div>
</div>
