tensorflow/tf2.org
* Keras
** tf.keras 

#+begin_src python :results output
  import tensorflow as tf
  from tensorflow import keras
  from tensorflow.keras import layers

  x = tf.constant([2., 1., 0.1])
  print(tf.keras.layers.Softmax(axis=-1)(x))
  print(tf.nn.softmax(x))

#+end_src

#+RESULTS:
: tf.Tensor([0.6590012  0.24243298 0.09856589], shape=(3,), dtype=float32)
: tf.Tensor([0.6590012  0.24243298 0.09856589], shape=(3,), dtype=float32)

tf.keras.Model 是tf.keras.Sequential的父类(网络类）
Sequential类还有方法：
Sequential.compile()
Sequential.fit()
Sequential.predict()

tf.keras.layers.Layer 是网络层类的父类（网络层类）

** 模型的保存和加载
*** 保存数值
Sequential.save_weights('weights.ckpt')
重建了一样的网络后，重新加载
Sequential.load_weights('weights.ckpt')
*** 保存框架
tf.keras.Sequential.save('model.h5')
不需要重构模型，可以直接生成保存的模型
network = tf.keras.models.load_model('model.h5')
*** 跨系统平台保存恢复
tf.saved_model.save(network, 'model-savedmodel')
复制，分发该文件后，在跨平台上复现
network = tf.saved_model.load('model-savedmodel')
** self-def 
自定义网络层类，继承Layer
自定义网络类，继承Model

* regularation
** L0
控制网络中的非零权重

** L1
网络中的所有元素的绝对值之和
促使网络生成更多的稀疏矩阵
** L2
网络中的所有元素平方和
促使网络生成小比重的权值
* Dropout
tf.nn.dropout(x, rate = 0.5)
model.add(layers.Dropout(rate=0.5))
* Data Augmentation
** resize
tf.image.resize(x,[244,244])
** rote
tf.image.rot90(x,1) k为1时，代表一个90度的g逆时针旋转
** flip
tf.image.random_flip_left_right(x)
tf.image.random_flip_up_down(x)
** crop
先放大，再剪裁
tf.image.resize(x,[244,244])
tf.image.random_crop(x,[224,224,3])
* convolution neural network

