tensorflow/tf2.html

<div id="outline-container-org15d002d" class="outline-2">
<h2 id="org15d002d">Keras</h2>
<div class="outline-text-2" id="text-org15d002d">
</div>
<div id="outline-container-org85c17fb" class="outline-3">
<h3 id="org85c17fb">tf.keras</h3>
<div class="outline-text-3" id="text-org85c17fb">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> tensorflow <span style="color: #4f97d7; font-weight: bold;">as</span> tf
<span style="color: #4f97d7; font-weight: bold;">from</span> tensorflow <span style="color: #4f97d7; font-weight: bold;">import</span> keras
<span style="color: #4f97d7; font-weight: bold;">from</span> tensorflow.keras <span style="color: #4f97d7; font-weight: bold;">import</span> layers

<span style="color: #7590db;">x</span> = tf.constant([2., 1., 0.1])
<span style="color: #4f97d7; font-weight: bold;">print</span>(tf.keras.layers.Softmax(axis=-1)(x))
<span style="color: #4f97d7; font-weight: bold;">print</span>(tf.nn.softmax(x))

</pre>
</div>

<p>
tf.keras.Model 是tf.keras.Sequential的父类(网络类）
Sequential类还有方法：
Sequential.compile()
Sequential.fit()
Sequential.predict()
</p>

<p>
tf.keras.layers.Layer 是网络层类的父类（网络层类）
</p>
</div>
</div>

<div id="outline-container-org106b974" class="outline-3">
<h3 id="org106b974">模型的保存和加载</h3>
<div class="outline-text-3" id="text-org106b974">
</div>
<div id="outline-container-org26195f7" class="outline-4">
<h4 id="org26195f7">保存数值</h4>
<div class="outline-text-4" id="text-org26195f7">
<p>
Sequential.save<sub>weights</sub>('weights.ckpt')
重建了一样的网络后，重新加载
Sequential.load<sub>weights</sub>('weights.ckpt')
</p>
</div>
</div>
<div id="outline-container-org6732694" class="outline-4">
<h4 id="org6732694">保存框架</h4>
<div class="outline-text-4" id="text-org6732694">
<p>
tf.keras.Sequential.save('model.h5')
不需要重构模型，可以直接生成保存的模型
network = tf.keras.models.load<sub>model</sub>('model.h5')
</p>
</div>
</div>
<div id="outline-container-orgb18a191" class="outline-4">
<h4 id="orgb18a191">跨系统平台保存恢复</h4>
<div class="outline-text-4" id="text-orgb18a191">
<p>
tf.saved<sub>model.save</sub>(network, 'model-savedmodel')
复制，分发该文件后，在跨平台上复现
network = tf.saved<sub>model.load</sub>('model-savedmodel')
</p>
</div>
</div>
</div>
<div id="outline-container-org3128177" class="outline-3">
<h3 id="org3128177">self-def</h3>
<div class="outline-text-3" id="text-org3128177">
<p>
自定义网络层类，继承Layer
自定义网络类，继承Model
</p>
</div>
</div>
</div>

<div id="outline-container-org1dec6c9" class="outline-2">
<h2 id="org1dec6c9">regularation</h2>
<div class="outline-text-2" id="text-org1dec6c9">
</div>
<div id="outline-container-org8c17045" class="outline-3">
<h3 id="org8c17045">L0</h3>
<div class="outline-text-3" id="text-org8c17045">
<p>
控制网络中的非零权重
</p>
</div>
</div>

<div id="outline-container-org7770020" class="outline-3">
<h3 id="org7770020">L1</h3>
<div class="outline-text-3" id="text-org7770020">
<p>
网络中的所有元素的绝对值之和
促使网络生成更多的稀疏矩阵
</p>
</div>
</div>
<div id="outline-container-org0f6a4bf" class="outline-3">
<h3 id="org0f6a4bf">L2</h3>
<div class="outline-text-3" id="text-org0f6a4bf">
<p>
网络中的所有元素平方和
促使网络生成小比重的权值
</p>
</div>
</div>
</div>
<div id="outline-container-org4555ebc" class="outline-2">
<h2 id="org4555ebc">Dropout</h2>
<div class="outline-text-2" id="text-org4555ebc">
<p>
tf.nn.dropout(x, rate = 0.5)
model.add(layers.Dropout(rate=0.5))
</p>
</div>
</div>
<div id="outline-container-org542d182" class="outline-2">
<h2 id="org542d182">Data Augmentation</h2>
<div class="outline-text-2" id="text-org542d182">
</div>
<div id="outline-container-orga1bb446" class="outline-3">
<h3 id="orga1bb446">resize</h3>
<div class="outline-text-3" id="text-orga1bb446">
<p>
tf.image.resize(x,[244,244])
</p>
</div>
</div>
<div id="outline-container-org035c0c7" class="outline-3">
<h3 id="org035c0c7">rote</h3>
<div class="outline-text-3" id="text-org035c0c7">
<p>
tf.image.rot90(x,1) k为1时，代表一个90度的g逆时针旋转
</p>
</div>
</div>
<div id="outline-container-orgc854041" class="outline-3">
<h3 id="orgc854041">flip</h3>
<div class="outline-text-3" id="text-orgc854041">
<p>
tf.image.random<sub>flip</sub><sub>left</sub><sub>right</sub>(x)
tf.image.random<sub>flip</sub><sub>up</sub><sub>down</sub>(x)
</p>
</div>
</div>
<div id="outline-container-org92f9bb2" class="outline-3">
<h3 id="org92f9bb2">crop</h3>
<div class="outline-text-3" id="text-org92f9bb2">
<p>
先放大，再剪裁
tf.image.resize(x,[244,244])
tf.image.random<sub>crop</sub>(x,[224,224,3])
</p>
</div>
</div>
</div>
<div id="outline-container-org94b0034" class="outline-2">
<h2 id="org94b0034">convolution neural network</h2>
</div>


<div id="outline-container-org0db8c95" class="outline-2">
<h2 id="org0db8c95">Backlinks</h2>
</div>


<div id="outline-container-orga429ff7" class="outline-2">
<h2 id="orga429ff7">1 Backlinks</h2>
<div class="outline-text-2" id="text-orga429ff7">
</div>
<div id="outline-container-org3698520" class="outline-3">
<h3 id="org3698520"><a href="file:///home/sx/Dropbox/subjects/AI.html">AI</a></h3>
<div class="outline-text-3" id="text-org3698520">
<p>
<a href="file:///home/sx/Dropbox/Projects/tensorflow/tf2.html">tf2</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: sx</p>
<p class="date">Created: 2020-06-29 Mo 22:28</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
